 __Задача.__ Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

_Примеры:_
>[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

>[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

>[“Russia”, “Denmark”, “Kazan”] → []

### __Код__
Console.Clear(); // очищаем экран

string[] massif = new string[4] {"Hello", "2", "world", ":-)"}; // задаём массив из 4 элементов

Console.Write($"[{string.Join(" | ", massif)}]"); // выводим на экран массив, который задали

Console.WriteLine("\n"); // пропускаем строку

PrintArray(massif); // вызываем метод

__Метод, который решает поставленную задачу и выводит на экран конечный результат__

void PrintArray(string[] arr)

{

    string[] newarray = new string[arr.Length];
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i].Length <= 3)
        {
            newarray[i] = arr[i]; 
        }
    }
    Console.WriteLine("Конечный массив: ");
    Console.Write($"[{string.Join(" ", newarray)}]");

}